export enum Currency {
  'RUB' = 'RUB',
  'EUR' = 'EUR',
  'USD' = 'USD'
}

export enum Country {
  Russia = 'Russia',
  Belarus = 'Belarus',
  Ukraine = 'Ukraine',
  Kazakhstan = 'Kazahstan',
  Armenia = 'Armenia'
}

export const MOKK_PRODUCTS = [
  {
    name: 'Витаasssssssss ssssssssssss sssssssssssssssssssмин В6 таблетки БАД 5мг, №50',
    company: 'Vitascience',
    price: 33,
    img: 'aa3bab4c-8622-4d49-9792-cc409504e5b3.jpg',
    typeId: '1'
  },
  {
    name: 'Витаs50',
    company: 'Vitascience',
    price: 63,
    img: 'aa3bab4c-8622-4d49-9792-cc409504e5b3.jpg',
    typeId: '1'
  },
  {
    name: 'Витамин В6 таблетки БАД 5мг, №50',
    company: 'Vitascience',
    price: 973,
    img: 'aa3bab4c-8622-4d49-9792-cc409504e5b3.jpg',
    typeId: '1'
  },
  {
    name: 'Витамин В6 таблетки БАД 5мг, №50',
    company: 'Vitascience',
    price: 19,
    img: 'aa3bab4c-8622-4d49-9792-cc409504e5b3.jpg',
    typeId: '1'
  },
  {
    name: 'Витамин В6 таблетки БАД 5мг, №50',
    company: 'Vitascience',
    price: 2394,
    img: 'aa3bab4c-8622-4d49-9792-cc409504e5b3.jpg',
    typeId: '1'
  },
  {
    name: 'Витамин В6 asdasd БАД 5мг, №50',
    company: 'Vitascience',
    price: 9999,
    img: 'aa3bab4c-8622-4d49-9792-cc409504e5b3.jpg',
    typeId: '1'
  }
];

export const MOKK_HELPFULL = [
  {
    title: 'Как сохранить здоровым сердце при стрессе?',
    description:
      'Равным образом укрепление и развитие структуры влечет за собой процесс внедрения и модернизации дальнейших направлений развития.'
  },
  {
    title: 'Как сохранить здоровым сердце при стрессе?',
    description:
      'Равным образом укрепление и развитие структуры влечет за собой процесс внедрения и модернизации дальнейших направлений развития.'
  },
  {
    title: 'Как сохранить здоровым сердце при стрессе?',
    description:
      'Равным образом укрепление и развитие структуры влечет за собой процесс внедрения и модернизации дальнейших направлений развития.'
  },
  {
    title: 'Как сохранить здоровым сердце при стрессе?',
    description:
      'Равным образом укрепление и развитие структуры влечет за собой процесс внедрения и модернизации дальнейших направлений развития.'
  },
  {
    title: 'Как сохранить здоровым сердце при стрессе?',
    description:
      'Равным образом укрепление и развитие структуры влечет за собой процесс внедрения и модернизации дальнейших направлений развития.'
  }
];

export const MOKK_INSTRUCTION = [
  'Найдите лекарство по названию или в каталоге товаров',
  'Добавьте выбранный товар в корзину',
  'Проверьте наличие в аптеках',
  'Оформите заказ и ожидайте доставку'
];

export const MOKK_ADDRESSES = [
  {
    address: 'ул. Дзержинского, 100Б',
    name: 'Доктор Столетов',
    workingMode: 'пн-вс  8:00 - 20:00 Без обеда',
    count: 'Доступно 4 из 5',
    coordinates: [45.10016, 38.982589]
  },
  {
    address: 'ул. Восточно-Кругликовская, 34',
    name: 'Доктор Столетов',
    workingMode: 'пн-вс  8:00 - 20:00 Без обеда',
    count: 'Доступно полностью',
    coordinates: [45.051245, 39.029149]
  },
  {
    address: 'ул. Промышленная, 25',
    name: 'Апрель',
    workingMode: 'пн-вс  8:00 - 20:00 Без обеда',
    count: 'Доступно 2 из 5',
    coordinates: [45.041477, 38.991258]
  },
  {
    address: 'ул. Красная улица, 164',
    name: 'Доктор Столетов',
    workingMode: 'пн-вс  8:00 - 20:00 Без обеда',
    count: 'Доступно 4 из 5',
    coordinates: [45.040674, 38.976768]
  }
];

export const MOKK_POPULAR_QUESTIONS = [
  'Как оплатить заказ ?',
  'Почему указана цена «от» ?',
  'Могут ли цены отличаться от указанных на сайте ?',
  'Как я могу доверять качеству товаров ?',
  'Мой заказ могут продать пока я еду ?',
  'Кто может меня проконсультировать ?',
  'Сколько будет храниться заказ в аптеке ?',
  'Как я узнаю, что заказ принят ?',
  'Как я узнаю, что заказ готов к выдаче ?',
  'Как я могу заказать рецептурные препараты ?',
  'Какие лекарства я могу вернуть обратно ?'
];

export const MOKK_POPULAR_QUESTIONS1 = [
  { question: 'Как оплатить заказ ?', answear: 'Продаваемая продукция строго контролируется законодательством.' },
  { question: 'Почему указана цена «от» ?', answear: 'Продаваемая продукция строго контролируется законодательством.' },
  {
    question: 'Могут ли цены отличаться от указанных на сайте ?',
    answear: 'Продаваемая продукция строго контролируется законодательством.'
  },
  {
    question: 'Как я могу доверять качеству товаров ?',
    answear: 'Продаваемая продукция строго контролируется законодательством.'
  },
  {
    question: 'Мой заказ могут продать пока я еду ?',
    answear: 'Продаваемая продукция строго контролируется законодательством.'
  },
  {
    question: 'Кто может меня проконсультировать ?',
    answear: 'Продаваемая продукция строго контролируется законодательством.'
  },
  {
    question: 'Сколько будет храниться заказ в аптеке ?',
    answear: 'Продаваемая продукция строго контролируется законодательством.'
  },
  { question: 'Как я узнаю, что заказ принят ?', answear: 'Продаваемая продукция строго контролируется законодательством.' },
  {
    question: 'Как я узнаю, что заказ готов к выдаче ?',
    answear: 'Продаваемая продукция строго контролируется законодательством.'
  },
  {
    question: 'Как я могу заказать рецептурные препараты ?',
    answear: 'Продаваемая продукция строго контролируется законодательством.'
  },
  {
    question: 'Как я могу заказать рецептурные препараты ?',
    answear: 'Продаваемая продукция строго контролируется законодательством.'
  },
  '',
  '',
  '',
  '',
  '',
  '',

  // 'Как я узнаю, что заказ готов к выдаче ?',
  '',
  'Какие лекарства я могу вернуть обратно ?'
];
